# London House Data Analysis

In [1]:
import pandas as pd

In [3]:
data = pd.read_csv("London_Housing_Data.csv")
data.head()

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,NaN
1,2/1/1995,city of london,82203,E09000001,7.0,NaN
2,3/1/1995,city of london,79121,E09000001,14.0,NaN
3,4/1/1995,city of london,77101,E09000001,7.0,NaN
4,5/1/1995,city of london,84409,E09000001,10.0,NaN

In [4]:
data.tail()

            date     area  average_price       code  houses_sold  no_of_crimes
13544   9/1/2019  england         249942  E92000001      64605.0           NaN
13545  10/1/2019  england         249376  E92000001      68677.0           NaN
13546  11/1/2019  england         248515  E92000001      67814.0           NaN
13547  12/1/2019  england         250410  E92000001          NaN           NaN
13548   1/1/2020  england         247355  E92000001          NaN           NaN

In [5]:
data.count()

date             13549
area             13549
average_price    13549
code             13549
houses_sold      13455
no_of_crimes      7439
dtype: int64

In [6]:
data.nunique()

date               301
area                45
average_price    13343
code                45
houses_sold       3946
no_of_crimes      2669
dtype: int64

In [7]:
data.isnull().sum()

date                0
area                0
average_price       0
code                0
houses_sold        94
no_of_crimes     6110
dtype: int64

In [8]:
data.dtypes

date              object
area              object
average_price      int64
code              object
houses_sold      float64
no_of_crimes     float64
dtype: object

In [9]:
data.index

RangeIndex(start=0, stop=13549, step=1)

In [10]:
data.duplicated().sum()

0

In [12]:
len(data['date'].unique())

301

# Q. 1) Convert the Datatype of 'Date' column to Date-Time format.

In [13]:
data['date'] = pd.to_datetime(data['date'])
data['date']

0       1995-01-01
1       1995-02-01
2       1995-03-01
3       1995-04-01
4       1995-05-01
           ...
13544   2019-09-01
13545   2019-10-01
13546   2019-11-01
13547   2019-12-01
13548   2020-01-01
Name: date, Length: 13549, dtype: datetime64[ns]

# Q. 2) Add a new column ''year'' in the dataframe, which contains years only.

In [15]:
data['year'] = data['date'].dt.year

In [16]:
data

,date,area,average_price,code,houses_sold,no_of_crimes,year
0,1995-01-01,city of london,91449,E09000001,17.0,NaN,1995
1,1995-02-01,city of london,82203,E09000001,7.0,NaN,1995
2,1995-03-01,city of london,79121,E09000001,14.0,NaN,1995
3,1995-04-01,city of london,77101,E09000001,7.0,NaN,1995
4,1995-05-01,city of london,84409,E09000001,10.0,NaN,1995
...,...,...,...,...,...,...,...
13544,2019-09-01,england,249942,E92000001,64605.0,NaN,2019
13545,2019-10-01,england,249376,E92000001,68677.0,NaN,2019
13546,2019-11-01,england,248515,E92000001,67814.0,NaN,2019
13547,2019-12-01,england,250410,E92000001,NaN,NaN,2019
13548,2020-01-01,england,247355,E92000001,NaN,NaN,2020

# (2.B) Add a new column ''month'' as 2nd column in the dataframe, which contains month only.

In [17]:
data.insert(1,'month',data['date'].dt.month)

In [18]:
data

,date,month,area,average_price,code,houses_sold,no_of_crimes,year
0,1995-01-01,1,city of london,91449,E09000001,17.0,NaN,1995
1,1995-02-01,2,city of london,82203,E09000001,7.0,NaN,1995
2,1995-03-01,3,city of london,79121,E09000001,14.0,NaN,1995
3,1995-04-01,4,city of london,77101,E09000001,7.0,NaN,1995
4,1995-05-01,5,city of london,84409,E09000001,10.0,NaN,1995
...,...,...,...,...,...,...,...,...
13544,2019-09-01,9,england,249942,E92000001,64605.0,NaN,2019
13545,2019-10-01,10,england,249376,E92000001,68677.0,NaN,2019
13546,2019-11-01,11,england,248515,E92000001,67814.0,NaN,2019
13547,2019-12-01,12,england,250410,E92000001,NaN,NaN,2019
13548,2020-01-01,1,england,247355,E92000001,NaN,NaN,2020

# Q. 3) Remove the columns 'year' and 'month' from the dataframe.

In [19]:
data.drop(["year","month"],axis=1,inplace=True)

In [20]:
data

,date,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,city of london,91449,E09000001,17.0,NaN
1,1995-02-01,city of london,82203,E09000001,7.0,NaN
2,1995-03-01,city of london,79121,E09000001,14.0,NaN
3,1995-04-01,city of london,77101,E09000001,7.0,NaN
4,1995-05-01,city of london,84409,E09000001,10.0,NaN
...,...,...,...,...,...,...
13544,2019-09-01,england,249942,E92000001,64605.0,NaN
13545,2019-10-01,england,249376,E92000001,68677.0,NaN
13546,2019-11-01,england,248515,E92000001,67814.0,NaN
13547,2019-12-01,england,250410,E92000001,NaN,NaN
13548,2020-01-01,england,247355,E92000001,NaN,NaN

# Q. 4) Show all the records where 'No. of Crimes' is 0. And, how many such records are there ?

In [26]:
no_crime =len(data[data['no_of_crimes'] == 0])
print(f"Number of times crime zero is {no_crime}")

Number of times crime zero is 104

# Q. 5) What is the maximum & minimum 'average_price' per year in england ?

In [27]:
data.groupby('area').average_price.max()

area
barking and dagenham       305882
barnet                     549401
bexley                     347531
brent                      519754
bromley                    449293
camden                     881212
city of london             939912
croydon                    378859
ealing                     489687
east midlands              196534
east of england            294035
enfield                    404393
england                    250410
greenwich                  408407
hackney                    575846
hammersmith and fulham     781175
haringey                   578728
harrow                     479341
havering                   373762
hillingdon                 419452
hounslow                   413672
inner london               593486
islington                  677798
kensington and chelsea    1463378
kingston upon thames       511260
lambeth                    532804
lewisham                   423063
london                     488527
merton                     534091
newham                     371678
north east                 139400
north west                 167430
outer london               432669
redbridge                  430708
richmond upon thames       682854
south east                 328061
south west                 259145
southwark                  535685
sutton                     387410
tower hamlets              470788
waltham forest             452299
wandsworth                 633826
west midlands              201447
westminster               1117408
yorks and the humber       166932
Name: average_price, dtype: int64

In [28]:
data.groupby('area').average_price.min()

area
barking and dagenham       50460
barnet                     90107
bexley                     63723
brent                      71307
bromley                    81124
camden                    115419
city of london             77101
croydon                    68006
ealing                     79272
east midlands              44506
east of england            55033
enfield                    70631
england                    52333
greenwich                  60993
hackney                    61297
hammersmith and fulham    120636
haringey                   76288
harrow                     82054
havering                   66182
hillingdon                 71760
hounslow                   71052
inner london               75886
islington                  89406
kensington and chelsea    182345
kingston upon thames       80876
lambeth                    65382
lewisham                   57700
london                     72778
merton                     79569
newham                     53154
north east                 40722
north west                 42599
outer london               72592
redbridge                  72142
richmond upon thames      106875
south east                 63715
south west                 53081
southwark                  60886
sutton                     69291
tower hamlets              59865
waltham forest             60252
wandsworth                 86518
west midlands              47952
westminster               131468
yorks and the humber       43461
Name: average_price, dtype: int64

# Q. 6) What is the Maximum & Minimum No. of Crimes recorded per area ?

In [29]:
data.groupby('area').no_of_crimes.max()

area
barking and dagenham      2049.0
barnet                    2893.0
bexley                    1914.0
brent                     2937.0
bromley                   2637.0
camden                    4558.0
city of london              10.0
croydon                   3263.0
ealing                    3401.0
east midlands                NaN
east of england              NaN
enfield                   2798.0
england                      NaN
greenwich                 2853.0
hackney                   3466.0
hammersmith and fulham    2645.0
haringey                  3199.0
harrow                    1763.0
havering                  1956.0
hillingdon                2819.0
hounslow                  2817.0
inner london                 NaN
islington                 3384.0
kensington and chelsea    2778.0
kingston upon thames      1379.0
lambeth                   4701.0
lewisham                  2813.0
london                       NaN
merton                    1623.0
newham                    3668.0
north east                   NaN
north west                   NaN
outer london                 NaN
redbridge                 2560.0
richmond upon thames      1551.0
south east                   NaN
south west                   NaN
southwark                 3821.0
sutton                    1425.0
tower hamlets             3316.0
waltham forest            2941.0
wandsworth                3051.0
west midlands                NaN
westminster               7461.0
yorks and the humber         NaN
Name: no_of_crimes, dtype: float64

In [30]:
data.groupby('area').no_of_crimes.min()

area
barking and dagenham      1217.0
barnet                    1703.0
bexley                     860.0
brent                     1850.0
bromley                   1441.0
camden                    2079.0
city of london               0.0
croydon                   2031.0
ealing                    1871.0
east midlands                NaN
east of england              NaN
enfield                   1635.0
england                      NaN
greenwich                 1513.0
hackney                   1870.0
hammersmith and fulham    1323.0
haringey                  1536.0
harrow                     937.0
havering                  1130.0
hillingdon                1445.0
hounslow                  1529.0
inner london                 NaN
islington                 1871.0
kensington and chelsea    1347.0
kingston upon thames       692.0
lambeth                   2381.0
lewisham                  1675.0
london                       NaN
merton                     819.0
newham                    2130.0
north east                   NaN
north west                   NaN
outer london                 NaN
redbridge                 1487.0
richmond upon thames       700.0
south east                   NaN
south west                   NaN
southwark                 2267.0
sutton                     787.0
tower hamlets             1646.0
waltham forest            1575.0
wandsworth                1582.0
west midlands                NaN
westminster               3504.0
yorks and the humber         NaN
Name: no_of_crimes, dtype: float64

# Q. 7) Show the total count of records of each area, where average price is less than 100000.

In [31]:
data[data['average_price'] < 100000 ].area.value_counts()

north east              112
north west              111
yorks and the humber    110
east midlands            96
west midlands            94
england                  87
barking and dagenham     85
south west               78
east of england          76
newham                   72
bexley                   64
waltham forest           64
lewisham                 62
havering                 60
south east               59
greenwich                59
croydon                  57
enfield                  54
sutton                   54
hackney                  53
redbridge                52
southwark                48
tower hamlets            47
outer london             46
hillingdon               44
lambeth                  41
hounslow                 41
brent                    40
london                   39
merton                   35
haringey                 33
bromley                  33
inner london             31
ealing                   31
kingston upon thames     30
harrow                   30
wandsworth               26
barnet                   25
islington                19
city of london           11
Name: area, dtype: int64